package edu.kh.memo;

public class Inheritance {

	/*
	
	상속 (Inheritance)
	
	부모객체가 가지고 있는것들(속성, 기능)을 자식객체가 이어 받는것
	자식객체는 부모의 속성과 기능과 자신의 속성과 기능을 모두 사용할 수 있다.
	
	<= 유지보수성 증가 코드길이 감소 재사용성 증가
	
	**** 
	상속의 개념
	다른 클래스가 가지고 있는 멤버(필드, 메소드)들을 새로 작성할 클래스에서 직접 만들지 않고
	상속을 받음으로써 새 클래스가 자신의 멤버처럼 사용할 수 있는 기능
	
	상속의 목적
	클래스의 재사용, 연관된 일련의 클래스들에 대한 공통적인 규약 정의
	
	상속의 장점
	 1. 보다 적은 양의 코드로 새로운 클래스 작성 가능
	 2. 코드를 공통적으로 관리하기 때문에 코드의 추가 및 변경 용이
	 3. 코드의 중복을 제거하여 프로그램의 생산성과 유지보수에 크게 기여
	****
	
	[접근제한자] class 클래스명 extends 클래스명 {}

	public class Academy // 자식 extends Company // 부모 {}
	
	
	***
	
	오버라이딩 특징 등 + 오버 로딩과의 차이점 중요

	***
	
	*/
}
